{"id":"a064c2b9-345a-46f3-b5cf-1b0b0c73b7e6","updated_at":"2024-06-09T09:56:54.050Z","updated_by":"elastic","created_at":"2024-06-09T09:56:54.050Z","created_by":"elastic","name":"Veeam Backup & Replication - Marked as infected ","tags":[],"interval":"30s","enabled":false,"revision":0,"description":"A restore point got marked as infected.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.10.11.250:5601/app/security"},"author":[],"false_positives":[],"from":"now-90s","rule_id":"4e37adde-094d-42a7-9ddf-4b34c66e1175","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"ba2ce833-084f-478a-b0c7-971a6e0458a2","query":"vbr_data.instanceId.keyword : \"42220\"","filters":[],"actions":[{"group":"default","id":"78f68898-ee4e-4d47-a0c8-4a87d6479f66","params":{"documents":[{"rule_id":{"type":"text"},"rule_name":{"type":"text"},"alert_id":{"type":"text"},"context_message":{"type":"text"}}]},"action_type_id":".index","uuid":"7dafaeee-5f19-431e-bf1d-0644e35101bb","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null}}]}
{"id":"78f68898-ee4e-4d47-a0c8-4a87d6479f66","type":"action","updated_at":"2024-06-09T09:41:39.297Z","created_at":"2024-06-09T09:41:39.297Z","version":"WzExMzMsMV0=","attributes":{"actionTypeId":".index","name":"Test","isMissingSecrets":false,"config":{"index":"veeam-*","refresh":false,"executionTimeField":null},"secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.3.0"}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
