{"id":"7b05eb1d-bf6c-46a1-9673-826d85acb7f0","updated_at":"2024-06-27T07:31:41.311Z","updated_by":"elastic","created_at":"2024-06-27T07:04:00.788Z","created_by":"elastic","name":"Invalid code for Mulit-Factor entered 3 times in a row","tags":[],"interval":"30s","enabled":true,"revision":8,"description":"Invalid code for Mulit-Factor entered 3 times in a row","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.10.11.250:5601/app/security"},"author":[],"false_positives":[],"from":"now-90s","rule_id":"13ead32d-2d8b-4e7a-b88d-18bea49ee41c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"ba2ce833-084f-478a-b0c7-971a6e0458a2","query":"vbr_data.instanceId.keyword : \"40205\"","filters":[],"threshold":{"field":[],"value":3,"cardinality":[{"field":"@timestamp","value":3}]},"actions":[]}
{"id":"2ea7fff2-0683-4a65-8b44-7373428a6014","updated_at":"2024-06-27T07:35:25.805Z","updated_by":"elastic","created_at":"2024-06-09T13:53:32.011Z","created_by":"elastic","name":"Veeam Backup & Replication - Marked as infected ","tags":[],"interval":"30s","enabled":true,"revision":0,"description":"Infected restore point","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.10.11.250:5601/app/security"},"author":[],"false_positives":[],"from":"now-90s","rule_id":"b780394c-7706-465c-b80b-515fa6f639f4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"ba2ce833-084f-478a-b0c7-971a6e0458a2","query":"vbr_data.instanceId.keyword : \"42220\"","filters":[],"actions":[]}
{"id":"b1287737-349f-4cf7-8efc-3e01c5acfd2f","updated_at":"2024-06-27T07:28:01.230Z","updated_by":"elastic","created_at":"2024-06-27T07:28:01.230Z","created_by":"elastic","name":"Allowed Attempts for Multi-Factor Authentication Exceeded","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"Allowed Attempts for Multi-Factor Authentication Exceeded","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.10.11.250:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"d2cbfaa8-157c-43a7-a663-9ca58a12e48f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"ba2ce833-084f-478a-b0c7-971a6e0458a2","query":"vbr_data.instanceId.keyword : \"40206\" ","filters":[],"actions":[]}
{"exported_count":3,"exported_rules_count":3,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
